benchmarks/lora/definitive_results/performance_analysis/memory_overhead/llama-2-7b/p25_dataset/_440_16_/log_17712077.out
WARNING 03-24 14:59:06 _custom_ops.py:14] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=10608, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_p25.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=4000, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, request_rate_by_lora=None, seed=0, trust_remote_code=False, disable_tqdm=True, save_result=True, metadata=None, result_dir='benchmarks/lora/definitive_results/memory_overhead/llama-2-7b/p25_dataset/_440_16_', launch_server=True, server_args='--port=10608 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b --enable-lora --max-num-seqs=4096 --max-loras=440 --max-lora-rank=16', disable_log_stats=False, disable_loras_users=True, user_lora_request_relation=None, infinite_behaviour=False, restrict_loras=None, lora_pre_loading=False)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     4000      
Benchmark duration (s):                  47.67     
Total input tokens:                      92000     
Total generated tokens:                  108000    
Request throughput (req/s):              83.91     
Input token throughput (tok/s):          1929.94   
Output token throughput (tok/s):         2265.59   
---------------Time to First Token----------------
Mean TTFT (ms):                          24532.76  
Median TTFT (ms):                        24841.04  
P99 TTFT (ms):                           46228.02  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          45.95     
Median TPOT (ms):                        38.77     
P99 TPOT (ms):                           118.41    
---------------Inter-token Latency----------------
Mean ITL (ms):                           45.89     
Median ITL (ms):                         28.98     
P99 ITL (ms):                            374.29    
==================================================
Concurrent checker terminated
Server terminated